/*-------------------------------------------------------------------------
工程名称：参数存储于内部FLASH操作程序
描述说明：
修改说明：<<-------------------------------------------------------->>
					日期   修改人    版本号		修改内容
					150611 赵铭章    5.0.0		新建立
																		
					

					<<-------------------------------------------------------->>
					日期   修改人    版本号		修改内容
					
-------------------------------------------------------------------------*/

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __M_FLASH_H
#define __M_FLASH_H


/* Includes ------------------------------------------------------------------*/
#include "global_includes.h"
#include "Xtend_900.h"
#include "local_handle.h"


/* Private define ------------------------------------------------------------*/
#define SAVE_START_ADDRESS 	0x080e0000					//参数存储地址


/* Exported function prototypes -----------------------------------------------*/
void save_parameter(void);
void load_parameter(void);


#endif
