/*-------------------------------------------------------------------------
工程名称：遥控器平台串口驱动程序文档
描述说明：
修改说明：<<-------------------------------------------------------->>
					日期   修改人    版本号		修改内容
					150526 赵铭章    5.0.0		新建立
																		USART1 作为915模块通信口
																		USART2 作为调试口
					

					<<-------------------------------------------------------->>
					日期   修改人    版本号		修改内容
					
-------------------------------------------------------------------------*/

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __SETUART_H
#define __SETUART_H


/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx.h"
#include <stdio.h>


/* Private define ------------------------------------------------------------*/
#define USART1_DR_Address    (&(USART1->DR)) 
#define USART1_RX_BUFFER_SIZE			50			//以半字为单位


/* Public variables ---------------------------------------------------------*/
extern uint16_t USART1_RX_Buffer[USART1_RX_BUFFER_SIZE];						//USART1 900M数传接收DMA缓冲区


/*-------------------------------------------------------------------------
	函数名：mCOMInit
	功  能：初始化数传通信串口以及调试用串口
					USART1 作为900MHz数传通信
					USART2 作为Debug用
	参  数：
	返回值：
-------------------------------------------------------------------------*/
void mCOMInit(void);


#endif
