/*-------------------------------------------------------------------------
工程名称：定时中断相关程序
描述说明：
修改说明：<<-------------------------------------------------------->>
					日期   修改人    版本号		修改内容
					150704 赵铭章    5.0.0		新建立
																		
					
					<<-------------------------------------------------------->>
					日期   修改人    版本号		修改内容
					
-------------------------------------------------------------------------*/


/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __SET_TIMER_H
#define __SET_TIMER_H


/* Includes ------------------------------------------------------------------*/
#include "global_includes.h"


/* Exported variables ---------------------------------------------------------*/
extern volatile uint32_t IC2Value, DutyCycle, Frequency;
extern uint8_t RSSI_Interrupt_flag;						//信号强度中断标志


/* Exported function prototypes -----------------------------------------------*/
void capture_Timer3_init(void);
void TIM3_IRQHandler(void);


#endif
