/*-------------------------------------------------------------------------
工程名称：遥控器平台串口驱动程序文档
描述说明：
修改说明：<<-------------------------------------------------------->>
					日期   修改人    版本号		修改内容
					150526 赵铭章    5.0.0		新建立
																		USART1 作为915模块通信口
																		USART2 作为调试口
					

					<<-------------------------------------------------------->>
					日期   修改人    版本号		修改内容
					
-------------------------------------------------------------------------*/


/* Includes ------------------------------------------------------------------*/
#include "SetUART.h"
#include "driver_xtend900.h"


/* Private variables ---------------------------------------------------------*/
/* Public variables ---------------------------------------------------------*/
uint8_t USART1_RX_Buffer[USART1_RX_BUFFER_SIZE];						//USART1 数据接收缓冲区
uint16_t receive_pointer = 0;																//接收缓冲区指针
uint32_t receive_counter = 0;																//接收字节总数
uint32_t receive_good_count = 0;														//于测试模式下统计接收正确的字节数

uint8_t USART1_TX_Buffer[USART1_TX_BUFFER_SIZE];						//USART1 数据发送缓冲区
uint16_t transmit_pointer = 0;															//发送缓冲区指针

int rfcommandReceivedBufCount = 0;				//接收数据缓冲区
u8 rfcommandReceivedBuf[100];							//32					


/*-------------------------------------------------------------------------
	函数名：mCOMInit
	功  能：初始化数传通信串口以及调试用串口
					USART1 作为900MHz数传通信
					USART2 作为Debug用
	参  数：
	返回值：
-------------------------------------------------------------------------*/
